{
	"pluginmetadataversion" : 2,
	"name": "VulnFanatic",
	"type": ["helper"],
	"api": ["python3"],
	"description": "Assistant plugin for vulnerability research.",
	"longdescription": "This plugin aims to assist during the vulnerability research process by providing a full tracing of sources of parameters to selected functions. It also provides a scanning capability which uses the function tracer and applies several rules to detect potentially dangerous function calls. \n\n### Highlighter###\n\nThe highlighter part of the plugin can be used by selecting a function call and using the option `[VulnFanatic] Highlight parameters` to highlight important parts which influence the parameters to the highlighted function call. To remove this highlight use option `[VulnFanatic] Clear highlighted parameters`.\n\n### Scanner###\n\nScanner is using set of rules and function tracker to perform basic analysis to detect any potentially vulnerable function calls. Issues that are found by this component are marked with tags that reflect the priority for a follow-up manual analysis. Following are the priority categories:\n\n* 🔴 High - Detected conditions are likely to lead to vulnerability.\n* 🟠 Medium - Detected conditions could theoretically lead to vulnerability.\n* 🟡 Low - Detected conditions are unlikely to lead to vulnerability.\n* 🔵 Info - Detected conditions were not clear enough to determine if the call is secure or not.\n\n",
	"license": {
		"name": "Apache-2.0",
      	"text": "Copyright 2020 Martin Petran\n\nLicensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at\n\n\thttp://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License."
  	},
	"platforms" : ["Darwin", "Linux", "Windows"],
	"installinstructions" : {
		"Darwin" : "N/A",
		"Linux" : "N/A",
		"Windows" : "N/A"
	},
	"dependencies": {
		"pip": [],
		"apt": [],
		"installers": [],
		"other": []
	},
	"version": "2.0",
	"author": "Martin Petran",
	"minimumbinaryninjaversion": 2166
}
